package ingeniumbd.com.eidwish;

import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.widget.Button;

public class Mangso extends AppCompatActivity implements View.OnClickListener{

    private Button btnOne,btnTwo, btnThree, btnFour, btnFive, btnSix, btnSeven, btnEight, btnNine, btnTen,btnEleven,btnTwelve,btnThirteen,btnFourteen,btnFifteen,btnSixteen,btnSeventeen,btnEighteen,btnNineteen,btnTwenty;
    String one = "উপকরণ: খাসির মাংস ২ কেজি, এলাচ ৬টি, লবঙ্গ ৫-৬টি, আনারসের রস ২ টেবিল চামচ, রসুনের রস ১ টেবিল চামচ, তেজপাতা ৪টি, পেঁয়াজের রস ২ টেবিল চামচ, দারচিনি ৬ টুকরা, জাফরান আধা চা-চামচ, টক দই ১ কাপ, লবণ পরিমাণ মতো, সরিষার তেল আধা কাপ, সাদা গোলমরিচ গুঁড়া ২ চা-চামচ, চিনি ১ টেবিল চামচ, জয়ত্রি গুঁড়া আধা চা-চামচ।\n" +
            "প্রণালি: মাংস বড় টুকরা করে কেটে ধুয়ে পানি ঝরিয়ে নিতে হবে। ওপরের সব উপকরণ দিয়ে মাখিয়ে ৫-৬ ঘণ্টা রাখতে হবে।\n" +
            "উপকরণ: পোলাওয়ের চাল ১ কেজি, পেঁয়াজ বেরেস্তা আধা কাপ, মাঝারি আকারের আলু ১০-১২টি, জাফরান ১ চা-চামচ, পেস্তাবাদাম কুচি ৪ টেবিল চামচ, কাজু ১ কাপ, কাঁচামরিচ ১৫-১৬টি, ঘন দুধ ১ কাপ, মিষ্টি আতর ৫-৬ ফোঁটা, ঘি ১ কাপ, মালাই আধা কাপ, দারচিনি ৬ টুকরা, আলুবোখরা ১০-১২টি, এলাচ ৪টি, কিশমিশ ২ টেবিল চামচ, লবঙ্গ ৬টি, কেওড়া ২ টেবিল চামচ।\n" +
            "প্রণালি: চাল ধুয়ে পানি ঝরিয়ে পরিমাণমতো লবণ ও ২ টেবিল চামচ লেবুর রস মাখিয়ে রাখতে হবে। আলু ছিলে সামান্য লবণ মাখিয়ে রাখতে হবে। কেওড়ার পানিতে জাফরান ভিজিয়ে ২০-২৫ মিনিট রাখতে হবে। বিরিয়ানির হাঁড়িতে প্রথমে মাখানো মাংস রাখতে হবে। তারপর আলু দিতে হবে। কাজু ও আলুবোখরা দিতে হবে। কাঁচামরিচ, চাল, গরম মসলা দিতে হবে। কিশমিশ, পেস্তাবাদাম কুচি দিতে হবে। দুধ, মালাই দিতে হবে। ৬ কাপ পানি দিতে হবে। ঘি, জাফরান মিশ্রিত কেওড়ার পানি, মিষ্টি আতর কিছু বেরেস্তা দিয়ে ঢাকনা দিয়ে ঢেকে চতুর্দিকে ময়দা মথে আটকিয়ে দিতে হবে। ৫ মিনিট বেশি জ্বালে, ১০ মিনিট মাঝারি জ্বালে, ১৫-২০ মিনিট অল্প জ্বালে রাখতে হবে। ১০-১৫ মিনিট দমে রেখে নামাতে হবে। নবাবি বিরিয়ানি সার্ভিং ডিশে ঢেলে কিছু পেস্তা কুচি ও বেরেস্তা দিয়ে সালাদ ও বোরহানির সঙ্গে পরিবেশন করা যায়।\n";
    String two= "উপকরণ: খাসির মাংস ৩ কেজি, আদা বাটা ২ টেবিল-চামচ, পোস্তদানা বাটা ১ টেবিল-চামচ, শাহি জিরা বাটা ১ চা-চামচ, শুকনা মরিচ (ঘিয়ে ভেজে গুঁড়া করা) ২ চা-চামচ, পেঁয়াজ কুচি ২ কাপ, ঘি এক কাপের সিকি ভাগ, টকদই এক কাপের সিকি ভাগ, দারচিনি ৬ টুকরা, লবঙ্গ ৮টি, বেরেস্তা আধা কাপ, জায়ফল-জয়ত্রি গুঁড়া আধা চা-চামচ, কাঁচামরিচ ৮টি, আলুবোখারা ৮টি, ঘন দুধ ১ কাপ, পেঁয়াজ বাটা আধা কাপ, রসুন বাটা ১ টেবিল-চামচ, বাদাম বাটা ৪ টেবিল-চামচ, সাদা গোলমরিচ গুঁড়া ২ চা-চামচ, তেল আধা কাপ, লবণ পরিমাণমতো; মিষ্টি দই আধা কাপ, ছোট এলাচ ৬টি, তেজপাতা ৪টি, গরম মসলার গুঁড়া ১ চা-চামচ, তেঁতুলের মাড় স্বাদমতো, টমেটো সস সিকি কাপ, কেওড়া ১ টেবিল-চামচ, মালাই আধা কাপ।\n" +
            "প্রণালি: মাংস বড় টুকরো করে টকদই ও মিষ্টিদই, লবণ, গোলমরিচ গুঁড়া দিয়ে মাখিয়ে এক থেকে দেড় ঘণ্টা রাখতে হবে। হাঁড়িতে তেল-ঘি গরম করে গরম মসলা ও তেজপাতা ফোঁড়ন দিয়ে পেঁয়াজ বাদামি রং করে ভেজে সব বাটা মসলা কষিয়ে মাংস দিয়ে মাঝারি আঁচে রান্না করতে হবে। মাংস তেলের ওপর এলে গরম পানি দিতে হবে। এরপর আলুবোখারা দিতে হবে।\n" +
            "মাংস সেদ্ধ হয়ে ঝোল কমে এলে বাদাম বাটা, দুধ, কেওড়া দিতে হবে। কাঁচামরিচ, তেঁতুলের মাড়, টমেটো সস দিতে হবে। বেরেস্তার সঙ্গে গরম মসলার গুঁড়া, জায়ফল-জয়িত্র গুঁড়া, শুকনা মরিচ ভাজা গুঁড়া একসঙ্গে মিশিয়ে মাংস দিয়ে কিছুক্ষণ চুলায় রেখে মালাই দিয়ে নামাতে হবে।\n";
    String three= "উপকরণ: গরুর মাংস দেড় কেজি, পেঁয়াজ কুচি ২ কাপ, তেল আধা কাপ, পেঁয়াজবাটা পৌনে ১ কাপ, আদাবাটা ১ টেবিল চামচ, রসুনবাটা আধা টেবিল চামচ, লবণ পরিমাণমতো, আস্ত ছোট পেঁয়াজ ২০-২৫টি, গোলাপজল ২ টেবিল চামচ, টক দই আধা কাপ, মিষ্টি দই ২ টেবিল চামচ, এলাচ ৬টি, দারচিনি ৮ টুকরা, ঘি আধা কাপ।\n" +
            "প্রণালি: পেঁয়াজের খোসা ছিলে ধুয়ে পানি ঝরিয়ে রেখে দিতে হবে। মাংস মাঝারি আকারের টুকরা করে ধুয়ে পানি ঝরিয়ে আদা, রসুন, লবণ দিয়ে মাখিয়ে তিন-চার ঘণ্টা রাখতে হবে। তেল গরম করে পেঁয়াজ বেরেস্তা করে মাংস দিয়ে অল্প জ্বালে কষাতে হবে। বেরেস্তা মাংসের সঙ্গে মিশে গেলে পেঁয়াজবাটা দিয়ে অল্প জ্বালে রান্না করতে হবে। মাঝেমধ্যে নেড়ে দিতে হবে। খেয়াল রাখতে হবে মাংস যেন তলায় না লাগে। ২০-২৫ মিনিট পর টক দই ও মিষ্টি দই দিতে হবে। দারচিনি, এলাচ, গোলাপজল দিয়ে ভুনতে হবে। পানি শুকিয়ে গেলে অল্প অল্প করে গরম পানি দিয়ে ভুনতে হবে মাংস সেদ্ধ না হওয়া পর্যন্ত। মাংস সেদ্ধ হলে গোটা পেঁয়াজ দিয়ে ২০-২৫ মিনিট রেখে নামাতে হবে। খেয়াল রাখতে হবে মাংস, পেঁয়াজ দুটোই সেদ্ধ হবে অথচ গোটা গোটা থাকবে।\n";
    String four= "উপকরণ: পেঁপে ১ কাপ, গাজর আধা কাপ, পটোল আধা কাপ, ঝিঙা ১ কাপ, মাশরুম আধা কাপ, ক্যাপসিকাম আধা কাপ, বেবি কর্ন আধা কাপ, মটরশুঁটি সিকি কাপ, টমেটো টুকরা ১ কাপ, স্বাদ লবণ ১ চা-চামচ, মুরগির মাংস ছোট টুকরা আধা কাপ, আদাবাটা ১ চা-চামচ, পেঁয়াজ পাতা আধা কাপ, রসুনবাটা আধা চা-চামচ, কারি পাউডার ১ চা-চামচ, তেজপাতা ১টি, বরবটি টুকরা আধা কাপ, ধনেপাতা কুচি ১ টেবিল চামচ, পেঁয়াজ মোটা কুচি ১ কাপ, তেল আধা কাপ, কাঁচামরিচ ফালি ৫-৬টি, দুধ পোনে ১ কাপ, চিনি ১ চা-চামচ, গোলমরিচ গুঁড়া ১ চা-চামচ, সয়াসস ১ টেবিল চামচ, লবণ পরিমাণ মতো।\n" +
            "প্রণালি: সব সবজি ঝিঙা বাদে, আলাদা আলাদা করে লবণ পানিতে আধা সেদ্ধ করে নিতে হবে। মুরগির মাংস সয়াসস মাখিয়ে ২০-২৫ মিনিট রাখতে হবে। তেল গরম করে মুরগির মাংস, লবণ, স্বাদলবণ, চিনি, আদা ও রসুনবাটা দিয়ে ভুনা করতে হবে। সামান্য পানি দিয়ে কষিয়ে পেঁয়াজ, কাঁচামরিচ দিয়ে কিছুক্ষণ পর সব সবজি পর্যায়ক্রমে দিয়ে অল্প আঁচে রান্না করতে হবে। কারি পাউডার ও দুধ দিয়ে কিছুক্ষণ রেখে নামাতে হবে।\n";
    String five= "উপকরণ ১\n" +
            "গরুর মাংসের কিমা ৫০০ গ্রাম,\n" +
            "ক্রিম ১ টে• চামচ,\n" +
            "আদা বাটা ১ চা চামচ,\n" +
            "গরম মসলার গুঁড়া আধা চা চামচ,\n" +
            "গোলমরিচ গুঁড়া আধা চা চামচ,\n" +
            "শুকনা মরিচ টালা গুঁড়া ১ চা চামচ,\n" +
            "ধনে টালা গুঁড়া ১ চা চামচ,\n" +
            "জিরা টালা গুঁড়া আধা চা চামচ,\n" +
            "লবণ পরিমাণমতো,\n" +
            "কর্নফ্লাওয়ার ৪ টে• চামচ,\n" +
            "লেবুর রস ১ টে• চামচ,\n" +
            "কাজুবাদাম বাটা ১ টে• চামচ\n" +
            "ডিম ১টি\n" +
            "প্রণালীঃ\n" +
            "সব উপকরণ একসঙ্গে মেখে লম্বা সেপের রোল করে ননস্টিক ফ্রাইপ্যানে অল্প তেল দিয়ে মৃদু আঁচে ভাজতে হবে।\n" +
            "খেয়াল রাখতে হবে, ভেতরে যেন ভালোমতো সেদ্ধ হয়।\n" +
            "মাংস সেদ্ধ হয়ে ভাজা হয়ে গেলে ঠান্ডা করে টুকরা করে রাখতে হবে।\n" +
            "উপকরণ ২\n" +
            "কাজুবাদাম বাটা ২ টে• চামচ,\n" +
            "দুধের ক্রিম আধা কাপ,\n" +
            "পেঁয়াজ মিহি কুচি আধা কাপ,\n" +
            "টমেটো সস ৪ টে• চামচ,\n" +
            "সাদা গোলমরিচ গুঁড়া ১ চা চামচ,\n" +
            "লবণ পরিমাণমতো,\n" +
            "গরম মসলার গুঁড়া আধা চা চামচ,\n" +
            "তেল ৪ টে• চামচ,\n" +
            "বিফ স্টেক ১ কাপ।\n" +
            "প্রণালীঃ\n" +
            "তেল গরম করে পেঁয়াজ ভুনতে হবে।\n" +
            "গরম মসলা, গোলমরিচ, কাজুবাদাম, টমেটো সস ও লবণ দিয়ে ভুনে স্টেক ঢেলে দিতে হবে।\n" +
            "ঝোল ঘন হয়ে এলে কাবারের ওপর ঢেলে দিয়ে ক্রিম দিয়ে পরিবেশন করুন।\n";
    String six= "উপকরণ ১\n" +
            "হাড়ছাড়া মাংস ৫০০ গ্রাম,\n" +
            "সয়াসস ২ টেবিল চামচ,\n" +
            "আদা বাটা ১ চা চামচ,\n" +
            "পেঁয়াজ বাটা ১ টে• চামচ,\n" +
            "বসুন বাটা আধা চা চামচ,\n" +
            "গোলমরিচ গুঁড়া ১ চা চামচ,\n" +
            "জায়ফল-জয়ত্রী গুঁড়া সিকি চা চামচ,\n" +
            "সরিষা গুঁড়া ১ টে• চা চামচ,\n" +
            "তেল ১ টে• চামচ,\n" +
            "লবণ পরিমাণমতো, মধু ১ টে• চামচ।\n" +
            "প্রণালীঃ\n" +
            "মাংস পাতলা করে ১ ইঞ্চি পুরু করে কেটে একটু থেঁতলে সব উপকরণ দিয়ে মাখিয়ে এক ঘণ্টা রাখতে হবে।\n" +
            "উপকরণ ২\n" +
            "ডিম ১টি,\n" +
            "ময়দা ২ টে• চামচ,\n" +
            "লবণ পরিমাণমতো,\n" +
            "বেকিং পাউডার আধা চা চামচ,\n" +
            "কর্নফ্লাওয়ার ২ টে• চামচ,\n" +
            "পানি ৪ টে• চামচ,\n" +
            "তেল ভাজার জন্য।\n" +
            "প্রণালীঃ\n" +
            "তেল বাদে সব উপকরণ একসঙ্গে মিশিয়ে মাখানো মাংস দিয়ে মাখিয়ে গরম ডুবো তেলে বাদামি রং করে ভেজে তুলতে হবে।\n" +
            "সারভিং ডিশে সাজিয়ে হোয়াইট সস দিয়ে পরিবেশন করুন।\n" +
            "হোয়াইট সসের উপকরণঃ\n" +
            "ময়দা ২ টে• চামচ,\n" +
            "মাখন ৩ টে• চামচ,\n" +
            "সিরকা ২ টে• চামচ,\n" +
            "চিনি ১ চা চামচ,\n" +
            "লবণ সামান্য,\n" +
            "তরল দুধ ১ কাপ,\n" +
            "সাদা গোলমরিচ গুঁড়া আধা চা চামচ।\n" +
            "প্রণালীঃ\n" +
            "মাখন গরম করে অল্প আঁচে ময়দা ভাজতে হবে।\n" +
            "ময়দায় বুদ্বুদ উঠলে সব দুধ একসঙ্গে দিয়ে নাড়তে হবে।\n" +
            "ময়দা মিশে গেলে বাকি সব উপকরণ দিয়ে ঘন হয়ে গেলে নামাতে হবে।\n";
    String seven= "উপকরণঃ\n" +
            "মাংসের কিমা ১ কেজি,\n" +
            "আদাকুচি ১ টে• চামচ,\n" +
            "শুকনা মরিচ টালা গুঁড়া ২ চা চামচ,\n" +
            "জয়ত্রী গুঁড়া সামান্য,\n" +
            "দারুচিনি ৪ টুকরা,\n" +
            "এলাচ ৪টি,\n" +
            "লবঙ্গ ৬টি,\n" +
            "বেসন টালা ৪ টে• চামচ,\n" +
            "জিরা টালা গুঁড়া ১ চা চামচ,\n" +
            "কর্নফ্লাওয়ার ৪ টে• চামচ,\n" +
            "পেঁপে বাটা ২ চা চামচ,\n" +
            "ডিম ১টি, লেবুর রস ২ টে• চামচ,\n" +
            "পেঁয়াজ কুচি ১ কাপ,\n" +
            "ধনেপাতা কুচি ৪ টে• চামচ,\n" +
            "কাঁচামরিচ কুচি ১ টে• চামচ,\n" +
            "তেল ১ টে• চামচ,\n" +
            "লবণ পরিমাণমতো,\n" +
            "তেল ভাজার জন্য।\n" +
            "প্রণালীঃ\n" +
            "১ টে• চামচ তেল গরম করে আদা ভেজে দারুচিনি, এলাচ, লবঙ্গ ভেজে উঠিয়ে রেখে ওই তেলে পেঁয়াজ ভেজে নিতে হবে।\n" +
            "তেল বাদে সব উপকরণ একসঙ্গে মাখিয়ে গোলাকার চ্যাপ্টা কাবাব তৈরি করে ছেঁকা তেলে ভেজে নিতে হবে।\n";
    String eight= "উপকরণঃ\n" +
            "খাসির মাংস ১ কেজি,\n" +
            "আদা বাটা ৩ চামচ,\n" +
            "খাসির পায়ের লম্বা হাড় ৪০০ গ্রাম,\n" +
            "রসুন বাটা ২ চা চামচ,\n" +
            "পেঁয়াজ বাটা ২ টে• চামচ,\n" +
            "জিরা বাটা ১ চা চামচ,\n" +
            "মরিচ গুঁড়া ১ চা চামচ,\n" +
            "হলুদ গুঁড়া ১ চা চামচ,\n" +
            "লবণ পরিমাণমতো,\n" +
            "সাদা গোলমরিচ গুঁড়া ১ চা চামচ,\n" +
            "গরম মসলা গুঁড়া ১ চা চামচ,\n" +
            "জায়ফল গুঁড়া সিকি চা চামচ,\n" +
            "পাকা পেঁপে বাটা ১ টে• চামচ,\n" +
            "গাজর বাটা ১ টে• চামচ,\n" +
            "টমেটো পিউরি ২ টে• চামচ,\n" +
            "আদাকুচি ১ চা চামচ,\n" +
            "রসুনকুচি আধা চা চামচ,\n" +
            "দারুচিনি ৬ টুকরা,\n" +
            "এলাচ ৪টি,\n" +
            "লবঙ্গ ৬টি,\n" +
            "তেজপাতা ২টি,\n" +
            "তেল ৬ টে• চামচ,\n" +
            "রগেন জোশ অর্থাৎ খাসির হাড়ের স্টেক ২ কাপ,\n" +
            "ঘি ২ টে• চামচ,\n" +
            "চিনি ১ চা চামচ।\n" +
            "প্রণালী ১\n" +
            "মাংস টুকরা করে গরম মসলার গুঁড়া বাদে সব বাটা মসলা, গুঁড়া মসলা, তেল, লবণ, দারুচিনি, এলাচ, লবঙ্গ দিয়ে কষাতে হবে।\n" +
            "অল্প অল্প করে পানি দিয়ে মাংস ভুনতে হবে।\n" +
            "মাংস সিদ্ধ হয়ে পানি শুকিয়ে গেলে টমেটো পিউরি দিয়ে কিছুক্ষণ নাড়াচাড়া করে নামাতে হবে।\n" +
            "অন্য পাত্রে খাসির হাড় ১ চা চামচ, আদা বাটা, ২ টুকরা দারুচিনি, ১টি তেজপাতা, আধা চা চামচ শুকনা মরিচের গুঁড়া লবণ দিয়ে ডুবো পানিতে সেদ্ধ করতে হবে এক ঘণ্টা।\n" +
            "ঠান্ডা করে হাড়ের মধ্য থেকে চামচ বা কাঠি দিয়ে ভেতরের সাদা তেলতেলে অংশ বের করে রাখতে হবে। স্টেক আলাদা রাখতে হবে।\n" +
            "ঘি গরম করে আদা-রসুন কুচি ভেজে পেঁপে বাটা ও গাজর বাটা দিয়ে কিছুক্ষণ ভুনে হাড়ের ভেতর থেকে বের করা অংশ দিয়ে কিছুক্ষণ ভুনে রান্না করা মাংস দিয়ে কিছুক্ষণ ভুনে রগেন জোশ দিয়ে গরম মসলার গুঁড়া ও কাঁচামরিচ দিয়ে নামাতে হবে।\n" +
            "ধনেপাতা কুচি ছিটিয়ে দিয়ে পরিবেশন করুন।\n";
    String nine= "উপকরণঃ\n" +
            "মাংস পাতলা টুকরা করে কাটা ৫০০ গ্রাম,\n" +
            "পেঁয়াজ মোটা কুচি ১ কাপ,\n" +
            "পেঁয়াজ সরু কুচি ২ টে• চামচ,\n" +
            "রসুন কুচি ১ টে• চামচ,\n" +
            "রসুন বাটা ১ চা চামচ,\n" +
            "আদা বাটা ১ টে• চামচ,\n" +
            "জিরা বাটা ১ চা চামচ,\n" +
            "ধনে বাটা ১ চা চামচ,\n" +
            "সরিষা বাটা ১ টে• চামচ,\n" +
            "হলুদ গুঁড়া আধা চা চামচ,\n" +
            "মরিচ গুঁড়া ১ চা চামচ,\n" +
            "গোলমরিচ গুঁড়া আধা চা চামচ,\n" +
            "গরম মসলার গুঁড়া ১ চা চামচ,\n" +
            "জায়ফল-জয়ত্রী গুঁড়া সিকি চা চামচ,\n" +
            "সিরকা ৪ টে• চামচ,\n" +
            "দারুচিনি ২ টুকরা,\n" +
            "এলাচ ২টি,\n" +
            "লবঙ্গ ৪টি,\n" +
            "তেজপাতা ২টি,\n" +
            "চিনি ১ চা চামচ,\n" +
            "টমেটো পিউরি ৩ টে• চামচ,\n" +
            "তেল আধা কাপ,\n" +
            "লবণ পরিমাণমতো,\n" +
            "কাঁচামরিচ ৪-৫টি।\n" +
            "প্রণালীঃ\n" +
            "তেল গরম করে রসুন কুচি ও পেঁয়াজ চিকন কুচি দিয়ে কিছুক্ষণ ভেজে সিরকা এবং সব বাটা মসলা ও গুঁড়া মসলা দিয়ে কিছুক্ষণ ভুনে মাংস দিয়ে কষাতে হবে।\n" +
            "এ সময় গরম মসলা ও লবণ দিতে হবে।\n" +
            "মাংসের ঝোল শুকালে অল্প অল্প পানি দিয়ে মাংস কষাতে হবে।\n" +
            "মাংস সিদ্ধ হলে টমেটো পিউরি, মোটা পেঁয়াজ কুচি ও চিনি দিয়ে চুলায় অল্প আঁচে রান্না করতে হবে।\n" +
            "পেঁয়াজ নরম হলে কাঁচামরিচ ও গরম মসলার গুঁড়া দিয়ে নামাতে হবে।\n";
    String ten= "উপকরণ : গরুর মাংস ১ কেজি, মিষ্টি কুমড়া ফালি করা ২৫০ গ্রাম, পেঁয়াজ কুচি ১ কাপ, আদাবাটা ১ চা-চামচ, রসুনবাটা ১ চা-চামচ, তেজপাতা ২/৩টা, মরিচের গুড়া ১ চা-চামচ, হলুদ গুড়া ১ চা-চামচ, জিড়া ১ টেঃ চামচ ভাজা, লবণ সাধ অনুযায়ী।\n" +
            "প্রণালী : মাংসের টুকরো ভাল করে ধুয়ে পানি জড়িয়ে রাখুন। এবার মাংসের সাথে উপরের উপকরণ দিয়ে মাংস ভাল করে কষিয়ে নিন এবং ৩ কাপ পানি দিয়ে মাংস সিদ্ধ করে নিন, মাংস তেল ছাড়লে মিষ্টি কুমড়া টুকরা দিয়ে দিন। মিষ্টি কুমড়া সিদ্ধ হয়ে গেলে ভাজা জিরা গুড়া দিয়ে নামিয়ে গরম গরম পরিবেশন করুন।\n";
    String eleven="উপকরণ: ক: গরুর মাংস পাতলা টুকরা আধা কেজি, আদা বাটা ১ চা-চামচ, রসুন বাটা আধা চা-চামচ, ধনে বাটা আধা চা-চামচ, জিরা বাটা আধা চা-চামচ, মরিচ গুঁড়ো ১ চা-চামচ, পোস্ত দানা ১ চা-চামচ, নানা রকম মসলা ১ চা-চামচ, লবঙ্গ কয়েকটি, গোল মরিচ কয়েকটি, টক দই ১ কাপ, লবণ পরিমাণমতো, বেরেস্তার জন্য পেঁয়াজ কুচি ২ কাপ, পেঁয়াজ বাটা ১ টেবিল-চামচ।\n" +
            "উপকরণ: খ: গরুর মাংসের মিহি কিমা ১ কাপ, আদা বাটা আধা চা-চামচ, রসুন বাটা সিকি চামচ, কাচা মরিচ কুচি ১ চা-চামচ, লবণ পরিমাণমতো, মসলা গুঁড়ো ১ চিমটি, ঘি ১ চা-চামচ, বিস্কুটের গুঁড়ো ১ টেবিল-চামচ।\n" +
            "প্রণালি: খ-গ্রুপের সবকিছু একসঙ্গে মেখে ছোট ছোট কোপ্তা বানাতে হবে।\n" +
            "ক-গ্রুপের মাংস সব মসলা দিয়ে মেখে তার ওপর খ-গ্রুপের কোপ্তাগুলো সাজিয়ে ২ কাপ গরম পানি দিয়ে সেদ্ধ করে নিতে হবে। প্রেসার কুকারে রান্না করলে হলে ৬-৭টি হুইসেল দিলে নামাতে হবে।\n" +
            "কড়াইতে আধা কাপ তেল ও ৩ টেবিল-চামচ ঘি দিয়ে তাতে ২ কাপ পেঁয়াজ দিয়ে বেরেস্তা করে নিন। এই তেলে ৬-৭টি শুকনো মরিচ ছেড়ে দিয়ে সেদ্ধ মাংস ঢেলে দিন। কিছুক্ষণ নাড়াচাড়া করে পানি দিতে হবে। বেরেস্তার সঙ্গে ১ চা-চামচ চিনি দিয়ে গুঁড়ো করে তা মাংসের কড়াইয়ে দিয়ে দিন।পানি শুকিয়ে তেল উঠলে কাবাব নামিয়ে দিয়ে কিশমিশ-বাদাম কুচি ওপরে ছড়িয়ে দিয়ে নামাতে হবে।\n" +
            "কয়েকটা গোলমরিচ ও লবঙ্গ দিতে হবে। ছোট এলাচ-দারুচিনি বেটে দিয়ে নামাতে হবে।\n";
    String twelve="উপকরণঃ মাংস আধা কেজি, দারুচিনি ও এলাচ ৬ পিস করে, চাল আধা কেজি, পেঁয়াজ কুচি আধা কাপ, আদা বাটা ১ চা চামচ, সয়াবিন তেল আধা কাপ, রসুন বাটা আধা চা চামচ, গরম পানি চালের দেড় গুণ, মরিচের গুঁড়া আধা চা চামচ, টক দই আধা কাপ, ধনে গুঁড়া আধা চা চামচ, শাহি জিরা আধা চা চামচ, জিরা গুঁড়া আধা চা চামচ, সরিষার তেল আধা কাপ, টেস্টিং সল্ট ১ চা চামচ, লবণ পরিমাণমতো, (জায়ফল, জয়ত্রী, এলাচ ও দারুচিনি) শাহি গুঁড়া মসলা ১ টে• চামচ।\n" +
            "প্রণালীঃ তেহারির মাংস ছোট করে কেটে নিতে হবে। এবার সব বাটা ও গুঁড়া মসলা (শাহি গুঁড়া মসলা বাদে) এবং টক দই, লবণ, এলাচ ও দারুচিনি দিয়ে মাখিয়ে মাংস ১৫ মিনিট মেরিনেট করে রাখতে হবে। এবার পাত্রে সয়াবিন তেল দিয়ে পেঁয়াজ লাল করে ভেজে তাতে মাংস ঢেলে দিয়ে কষাতে হবে। সেদ্ধ হওয়ার জন্য পানি দিতে হবে। সেদ্ধ হলে অল্প ঝোলসহ নামাতে হবে। নামিয়ে এর মধ্যে টেস্টিং সল্ট ও শাহি গুঁড়া মসলা দিয়ে ঢেকে রাখতে হবে। চাল ১০ মিনিট ভিজিয়ে রাখতে হবে। পাত্রে সরিষার তেল দিয়ে এলাচ-দারুচিনির ফোড়ন দিয়ে চাল দিতে হবে। একটু নেড়ে পানি দিতে হবে চালের দেড় গুণ। পরিমাণমতো লবণ দিতে হবে। পোলাওয়ের পানি সমান হলে তাওয়ার ওপর অল্প জ্বালে দমে বসাতে হবে। ১৫ মিনিট পরে রান্না করা মাংস মেশাতে হবে। ওপরে কেওড়ার জল ১ টে• চামচ ও আধা চা চামচ শাহি জিরা ছিটিয়ে দিয়ে আবার দমে রাখতে হবে ১০ থেকে ১৫ মিনিট। এবার সালাদ দিয়ে পরিবেশন করুন।\n";
    String thirteen="উপকর: মাংস ১ কেজি, আদা বাটা ১ টেবিল চামচ, রসুন বাটা ১ চা চামচ, ধনে বাটা ১ টেবিল চামচ, জিরা বাটা ১ চা চামচ, পেঁয়াজ বাটা ২ টেবিল চামচ, হলুদের গুড়া ১ চা চামচ, মরিচগুঁড়ো ১ টেবিল চামচ, টমেটোর সস ২ টেবিল চামচ, টকদই হাফ কাপ, তেল হাফ কাপ, পেঁয়াজ রেরেস্তা সিকি কাপ, তেজপাতা ২টা, এলাচ ২ টা, দারুচিনি ৪ টুকরো, গরম মসলারগুঁড়ো ১ চা চামচ।\n" +
            "যেভাবে তৈরি করবেন : মাংস টুকরা করে ধুয়ে সরবাটা মসলা ও গুঁড়া মসলা ভাল করে মিশিয়ে এবং মাখিয়ে ১ ঘন্টা রাখতে হবে। খেয়াল রাখতে হবে, গরম মসলার গুঁড়ো, টমেটো সস, পেঁয়াজ রেরেস্তা যেন একসঙ্গে না দিয়ে ফেলি। এক ঘন্টা রাখার পর চুলায় মাংস চাপিয়ে কষাতে হবে। তেল উপরে এলে পরিমাণ মতো পানি দিয়ে রান্না করতে হবে। মাংস সিদ্ধ হয়ে গেলে এবং সুরুয়া ঘন হয়ে এলে টমেটো সস, গরম মসলার গুঁড়ো ওপরে ছড়িয়ে পেঁয়াজ বেরেস্তা ছিটিয়ে একটু রেখে নামাতে হবে। পরোটা, নান, রুমালী রুটির সাথে পরিবেশন করুন।\n";
    String fourteen="উপকরণ : পোলাওয়ের চাল ৫০০ গ্রাম, গরুর মাংস ১ কেজি, টক দই ১ কাপ, পেঁপের রস আধা কাপ, আদা বাটা ১ টেবিল চামচ, রসুন বাটা ১ টেবিল চামচ, পেঁয়াজ বাটা ২ টেবিল চামচ, পেঁয়াজ বেরেস্তা ১ কাপ, মেলানো মসলা ১ টেবিল চামচ, শুকনা মরিচ বাটা ১ টেবিল চামচ, জিরা বাটা আধা টেবিল চামচ, পোস্তদানা বাটা ১ টেবিল চামচ, শাহি জিরা ১ চা চামচ, এলাচ ৪টি, তেল ১ কাপ, দারুচিনি ৪ টুকরা, জাফরান সামান্য (দুধে ভেজানো), মাওয়া ২ টেবিল চামচ, লবন স্বাদ অনুসারে।\n" +
            "প্রণালী : মাংস পাতলা করে কেটে পানি কষিয়ে শুকনা করে মুছে নিতে হবে। এবার মাংসের সঙ্গে টক দই, পেঁপের রস, আদা বাটা, তেল, রসুন বাটা, পেঁয়াজ বাটা, মেলানো মসলা, শুকনা মরিচ বাটা, জিরা বাটা, পোস্ত বাটা, এলাচ ২টি, দারুচিনি টুকরা ও লবণ একসঙ্গে মেখে ২-৩ ঘন্টা রাখতে হবে। এবার শিকে গেঁথে গ্রিল করে নিতে হবে। ১ লিটার পানিতে গ্রিল করার পর যে মসলা রয়ে যাবে, ওই মসলা পানির সঙ্গে দিয়ে বলক উঠলে তার মধ্যে শাহি জিরা, বাকি এলাচ, দারুচিনি ও লবণ দিয়ে পোলাও রান্না করে নিতে হবে। এবার প্রতি স্তরে পোলাও তার ওপর গ্রিল মাংস, পেঁয়াজ বেরেস্তা, মাওয়া আবার পোলাও দিতে হবে। এবার ওপরে ২ টেবিল চামচ ঘি ও জাফরান দিয়ে হাঁড়ির মুখ ঢেকে ২০ মিনিট চুলায় তাওয়া দিয়ে তার ওপর হাঁড়ি দিয়ে রাখতে হবে। আচারের সঙ্গে এই বিরিয়ানি খুব মজাদার।\n";
    String fifteen="উপকরণ: খাসি বা গরুর মাংস দেড় কেজি। আম বা জলপাইয়ের আচার ৩ টেবিল চামচ, পেঁয়াজ কুচি ২ কাপ, আদা বাটা ২ টেবিল চামচ, রসুন বাটা ২ চা চামচ, জিরা বাটা ১ চা চামচ, বাদাম বাটা ১ টেবিল চামচ, সরিষা বাটা ১ টেবিল চামচ, মরিচ গুঁড়া ১ টেবিল চামচ, হলুদ গুঁড়া ১ চা চামচ, লবণ পরিমাণমতো, দারচিনি ৪ টুকরা, এলাচ ৪টি, তেজপাতা ৪টি, মেথি আধা চা চামচ, তেল ১ কাপ, কাঁচামরিচ ৫-৬টি, টকদই আধা কাপ, চিনি ১ চা চামচ।\n" +
            "প্রণালী: মাংস টুকরা করে ধুয়ে সব বাটা মশলা, গুঁড়া মসলা, টকদই ও লবণ দিয়ে মাখিয়ে ১ ঘণ্টা রাখতে হবে। তেল গরম করে মেথি ফোড়ন দিয়ে তেল ছেঁকে নিয়ে পেঁয়াজ বাদামি করে ভেজে মাখানো মাংস দিয়ে কষাতে হবে। মাংস কয়েকবার কষিয়ে পরিমাণমতো গরম পানি দিয়ে রান্না করতে হবে। পানি শুকিয়ে গেলে কাঁচামরিচ, চিনি, আচার দিয়ে মাংস ভুনা ভুনা করে নামাতে হবে।\n";
    String sixteen="উপকরণঃ মোরগ বড় ১ টি, গোল মরিচ বাটা ১/২ চামচ, পেঁয়াজ বাটা ১/৪ কাপ, এলাচ ৪টি, আদা বাটা ১টেবিল চামচ, দারচিনি ৩ টুকরা, রসুন বাটা ১ চা চামচ, লবঙ্গ ২টি, হলুদ বাটা ১ চা চামচ, মরিচ বাটা ২ চা চামচ, জিরা বাটা ১/২ চা চামচ, দনে বাটা ১ টেবিল চামচ, লবন ২ চা চমচ, টমেটো সস ৩ তেবিল চামচ, পেঁয়াজ স্লাইস ৩টি, সয়াবিন তেল ১/২ কাপ।\n" +
            "  ১। মোরগ ১০-১২ টুকরা কর। মোরগের সাথে সব বাটা মসলা, গরম মসলা, লবণ ও অর্দ্বেক তেল মাখাও। এক কাপ পানি দিয়ে ঢেকে সিদ্ধ কর।\n" +
            "২। মাংস সিদ্ধ হলে অন্য একটি হাঁড়িতে বাকি তেল গরম করে পেঁয়াজ ভাজ। বাদামি হলে মাংস দিয়ে কষাও। টমেটো সস দিয়ে ২-৩ মিনিট কষাও। আধা কাপ ফুটানো পানি দিয়ে ঢেকে ১০ মিনিট দমে রাখ।\n";
    String seventeen="মোরগ ছোট ২টি, আদা কুচি ২ চা চামচ, জিরা বাটা ২ চা চামচ, রসুন বাটা ১ চা চামচ, হলুদ বাটা ১ চা চামচ, তেজপাতা ১ টি, দারচিনি ৩ টুকরা, লবন ১ চা চামচ, সিরকা ২ তেবিল চামচ, পেঁয়াজ বাটা ১/২ কাপ, মরিচ ৬টি, তেল ৩/৪ কাপ। \n" +
            "১। সব উপকরন হাঁড়িতে একসঙ্গে মিশাও। ঢাকনা দিয়ে মৃদু আঁচে রান্না কর।\n" +
            "২। পানি শুকালে মাংস কষাও। মাংস ভুনা হলে নামিয়ে নাও।\n" +
            "৩। দম মোরগ ওভেনে ১৮০ সেঃ তাপে ১-২ ঘন্টা ঢেকে রান্না করা যায়।\n";
    String eighteen="উপকরণঃ সয়াবিন তেল ২কাপ, মোরগের সিনা ৬টি, কচি পেঁয়াজ ১০টি, শুকনা মরিচ ৪টি, মৌরি ১/৪ চা চামচ, দারচিনি গুঁড়া ১/৮ কাপ, নারিকেলের দুধ ১/৪ কাপ, সয়াসস ১/৪ কাপ, লেবুর রস ২ তেবিল চামচ, ধনেপাতা কুচি ১/৪ কাপ।  \n" +
            "১। তেল গরম করে মাংসের দুই পিঠ হালকা করে ভেজে তোল। দশ মিনিটের মতো ভাজবে। কড়াইয়ে১/৪ কাপ তেল রেখে বাকি তেল তুলে ফেল।\n" +
            "২। কড়াইর তেলে মৃদু আঁচে পেঁয়াজ, মরিচ, মৌরি ও দারচিনি দিয়ে ২ মিনিট ভাজ। পেঁয়াজ নরম হলে নারকেলের দুধ, সয়াসস, লেবুর রস দিয়ে মাঝারি আঁচে নেড়ে নেড়ে ৫-১০ মিনিট ফুটাও।\n" +
            "৩। মাংস দিয়ে মাঝারি আঁচে সিদ্ধ না হওয়া পর্যন্ত রান্না কর। ধনেপাতা দাও।\n";
    String nineteen="উপকরণঃ মোরগ মাঝারি ২টি, দই ১ কাপ, পেঁয়াজ বাটা ৩/৪ কাপ, আদা বাটা ১ টেবিল চামচ, রসুন বাটা ১ চা চামচ, ধনে বাটা ১ টেবিল চামচ,জিরা বাটা ২ চা চামচ, মরিচ বাটা ১ টেবিল চামচ, পোস্তদানা ১তেবিল চামচ, জয়ত্রী গুঁড়া ১/৪ চা চামচ, আলু বোখরা ১/৪ কাপ, কিসমিস ১/৪ কাপ, বাদাম ১/৪ কাপ, লবন ২ চা চামচ, সয়াবিন তেল ১ কাপ। \n" +
            " ১। একটি হাঁড়িতে সব উপকরণ একসাথে মিশিয়ে ঢাকনা দিয়ে চুলায় দাও। কম আঁচে ১ ঘন্টা রান্না কর।\n" +
            "২। পানি শুকিয়ে তেলের উপর উঠলে কষাও। মাংস সিদ্ধ না হলে পানি দিয়ে কষাও। কষাণ হলে চুলা থেকে নামাও।\n" +
            "৩। উপরে কিছু কিসমিস বাদাম ছিটিয়ে দাও।\n";
    String twenty="উপকরণঃ মোরগের সিনার মাংস ১ কাপ, ধনে গুঁড়া ২ চা চামচ, লেবুর রস ১ চা চামচ, রসুন বাটা ২ চা চামচ, গোল মরিচের গুঁড়া ১/৪ চা চামচ, ক্যাপ্সিকাম ১/২ কাপ, ওরিগেনো ১ চা চামচ, তেল ১/৪ কাপ, পেঁয়াজ ১/৪ কাপ, লবন স্বাদমতো। \n" +
            "১। মোরগের সিনার মাংস হাড় থেকে ছাড়িয়ে লম্বা স্লাইসমতো টুকরা করে এক কাপ নাও। লেবুর রস,গোলমরিচ,ওরিগেনো ধনে ও রসুন বাটা দিয়ে মাখিয়ে ১ ঘন্টা রাখ।\n" +
            "২। সবুজ,হলুদ ও লাল রঙের ক্যাপসিকাম ১ সে.মি চওড়া ফালি করে ১/২ কাপ নাও। পেঁয়াজ মোটা ফালি কর।\n" +
            "৩। তেলে মাংস এক একবারে ১০-১২ টুকরা করে ভেজে তোল। একসংগে বেশী মাংস ভাজবে না।\n" +
            "৪। মাংস ভাজার পরে সেই কড়াইর তেলে রসুন বাটা দিয়ে পেঁয়াজ ভাজ। ক্যাপসিকাম দিয়ে হালকা ভেজে মাংস দাও। নেড়ে নেড়ে ধনেপাতা কুচি দিয়ে নামাও।\n";
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_mangso);
        btnOne = (Button) findViewById(R.id.btnNobabiBiriani);
        btnTwo = (Button) findViewById(R.id.btnBadsahiRojala);
        btnThree = (Button) findViewById(R.id.btnMangserKorma);
        btnFour = (Button) findViewById(R.id.btnCorySobji);
        btnFive = (Button) findViewById(R.id.btnMaliCubab);
        btnSix = (Button) findViewById(R.id.btnGulas);
        btnSeven = (Button) findViewById(R.id.btnChapliCubab);
        btnEight = (Button) findViewById(R.id.btnRogenJos);
        btnNine = (Button) findViewById(R.id.btnGoruBindula);
        btnTen = (Button) findViewById(R.id.btnMistikumraMangso);
        btnEleven = (Button) findViewById(R.id.btnHariaCubab);
        btnTwelve = (Button) findViewById(R.id.btnTeheri);
        btnThirteen = (Button) findViewById(R.id.btnMangserSurua);
        btnFourteen = (Button) findViewById(R.id.btnGorilaCubab);
        btnFifteen = (Button) findViewById(R.id.btnAcharMangso);
        btnSixteen = (Button) findViewById(R.id.btnChickenCarry);
        btnSeventeen = (Button) findViewById(R.id.btnMosamman);
        btnEighteen = (Button) findViewById(R.id.btnSingapur);
        btnNineteen = (Button) findViewById(R.id.btnMontajan);
        btnTwenty = (Button) findViewById(R.id.btnFahita);

        btnOne.setOnClickListener(this);
        btnTwo.setOnClickListener(this);
        btnThree.setOnClickListener(this);
        btnFour.setOnClickListener(this);
        btnFive.setOnClickListener(this);
        btnSix.setOnClickListener(this);
        btnSeven.setOnClickListener(this);
        btnEight.setOnClickListener(this);
        btnNine.setOnClickListener(this);
        btnTen.setOnClickListener(this);
        btnEleven.setOnClickListener(this);
        btnTwelve.setOnClickListener(this);
        btnThirteen.setOnClickListener(this);
        btnFourteen.setOnClickListener(this);
        btnFifteen.setOnClickListener(this);
        btnSixteen.setOnClickListener(this);
        btnSeventeen.setOnClickListener(this);
        btnEighteen.setOnClickListener(this);
        btnNineteen.setOnClickListener(this);
        btnTwenty.setOnClickListener(this);

        getSupportActionBar().setDisplayHomeAsUpEnabled(true);
        getSupportActionBar().setHomeButtonEnabled(true);
    }

    @Override
    public void onClick(View view) {
        if (view == btnOne){
            Intent intent = new Intent(Mangso.this, ContentActivity.class);
            intent.putExtra("Data", one);
            intent.putExtra("resourseInt", R.drawable.nobabi_birani);
            startActivity(intent);

        }
        if (view == btnTwo){
            Intent intent = new Intent(Mangso.this, ContentActivity.class);
            intent.putExtra("Data", two);
            intent.putExtra("resourseInt", R.drawable.badsahi_rojala);
            startActivity(intent);
        }
        if (view == btnThree){
            Intent intent = new Intent(Mangso.this, ContentActivity.class);
            intent.putExtra("Data", three);
            intent.putExtra("resourseInt", R.drawable.mangser_korma);
            startActivity(intent);
        }
        if (view == btnFour){
            Intent intent = new Intent(Mangso.this, ContentActivity.class);
            intent.putExtra("Data", four);
            intent.putExtra("resourseInt", R.drawable.kory_sobji);
            startActivity(intent);
        }
        if (view == btnFive){
            Intent intent = new Intent(Mangso.this, ContentActivity.class);
            intent.putExtra("Data", five);
            intent.putExtra("resourseInt", R.drawable.malai_cubab);
            startActivity(intent);
        }
        if (view == btnSix){
            Intent intent = new Intent(Mangso.this, ContentActivity.class);
            intent.putExtra("Data", six);
            intent.putExtra("resourseInt", R.drawable.gulas);
            startActivity(intent);
        }
        if (view == btnSeven){
            Intent intent = new Intent(Mangso.this, ContentActivity.class);
            intent.putExtra("Data", seven);
            intent.putExtra("resourseInt", R.drawable.chapli_cubab);
            startActivity(intent);
        }
        if (view == btnEight){
            Intent intent = new Intent(Mangso.this, ContentActivity.class);
            intent.putExtra("Data", eight);
            intent.putExtra("resourseInt", R.drawable.rogen_jos);
            startActivity(intent);
        }
        if (view == btnNine){
            Intent intent = new Intent(Mangso.this, ContentActivity.class);
            intent.putExtra("Data", nine);
            intent.putExtra("resourseInt", R.drawable.goru_vindula);
            startActivity(intent);
        }
        if (view == btnTen){
            Intent intent = new Intent(Mangso.this, ContentActivity.class);
            intent.putExtra("Data", ten);
            intent.putExtra("resourseInt", R.drawable.kumra_mangso);
            startActivity(intent);
        }
        if (view == btnEleven){
            Intent intent = new Intent(Mangso.this, ContentActivity.class);
            intent.putExtra("Data", eleven);
            intent.putExtra("resourseInt", R.drawable.haria_cubab);
            startActivity(intent);

        }
        if (view == btnTwelve){
            Intent intent = new Intent(Mangso.this, ContentActivity.class);
            intent.putExtra("Data", twelve);
            intent.putExtra("resourseInt", R.drawable.teheri);
            startActivity(intent);
        }
        if (view == btnThirteen){
            Intent intent = new Intent(Mangso.this, ContentActivity.class);
            intent.putExtra("Data", thirteen);
            intent.putExtra("resourseInt", R.drawable.mangser_surua);
            startActivity(intent);
        }
        if (view == btnFourteen){
            Intent intent = new Intent(Mangso.this, ContentActivity.class);
            intent.putExtra("Data", fourteen);
            intent.putExtra("resourseInt", R.drawable.gril_cubab);
            startActivity(intent);
        }
        if (view == btnFifteen){
            Intent intent = new Intent(Mangso.this, ContentActivity.class);
            intent.putExtra("Data", fifteen);
            intent.putExtra("resourseInt", R.drawable.achar_mangso);
            startActivity(intent);
        }
        if (view == btnSixteen){
            Intent intent = new Intent(Mangso.this, ContentActivity.class);
            intent.putExtra("Data", sixteen);
            intent.putExtra("resourseInt", R.drawable.chiken_curry);
            startActivity(intent);
        }
        if (view == btnSeventeen){
            Intent intent = new Intent(Mangso.this, ContentActivity.class);
            intent.putExtra("Data", seventeen);
            intent.putExtra("resourseInt", R.drawable.mosamman);
            startActivity(intent);
        }
        if (view == btnEighteen){
            Intent intent = new Intent(Mangso.this, ContentActivity.class);
            intent.putExtra("Data", eighteen);
            intent.putExtra("resourseInt", R.drawable.chiken_singapur);
            startActivity(intent);
        }
        if (view == btnNineteen){
            Intent intent = new Intent(Mangso.this, ContentActivity.class);
            intent.putExtra("Data", nineteen);
            intent.putExtra("resourseInt", R.drawable.moroger_montajan);
            startActivity(intent);
        }
        if (view == btnTwenty){
            Intent intent = new Intent(Mangso.this, ContentActivity.class);
            intent.putExtra("Data", twenty);
            intent.putExtra("resourseInt", R.drawable.chiken_fahita);
            startActivity(intent);
        }


    }
}

